Revit 2027 API
ThermalAsset.ThermalMaterialType Property
 The type of material that this thermal asset describes (e.g. solid, liquid, gas.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ThermalMaterialType ThermalMaterialType { get; }
Public ReadOnly Property ThermalMaterialType As ThermalMaterialType
	Get
public:
property ThermalMaterialType ThermalMaterialType {
	ThermalMaterialType get ();
}
member ThermalMaterialType : ThermalMaterialType with get
Property Value
ThermalMaterialType
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace